[
  {
    "timestamp": "2025-04-17T20:59:28.672941",
    "commentary": "Trent Boult continues to search for breakthroughs but has thus far been expensive, with Klaasen and Reddy rotating the strike effectively to keep the scoreboard ticking at 113 for 3 in the 17th over. The Mumbai Indians bowlers will need to tighten their lengths as the batters look to capitalize on any loose deliveries."
  },
  {
    "timestamp": "2025-04-17T20:59:52.942903",
    "commentary": "Trent Boult is struggling to find his rhythm, having gone for 27 runs in his 3.3 overs, while Klaasen and Reddy continue to rotate the strike effectively, pushing the score to 113 for 3 as they eye a strong finish to their innings. The Mumbai Indians bowlers must tighten their lengths to avoid being punished further as we approach the final overs."
  },
  {
    "timestamp": "2025-04-17T21:00:19.865654",
    "commentary": "Trent Boult has just claimed a crucial wicket, dismissing Nitish Kumar Reddy with a well-placed cross-seam delivery, leaving the score at 113 for 4 in the 16th over. Heinrich Klaasen, still at the crease, needs to find his rhythm as the Mumbai Indians bowlers look to capitalize on this breakthrough."
  },
  {
    "timestamp": "2025-04-17T21:00:42.965660",
    "commentary": "Trent Boult's wicket of Nitish Kumar Reddy has put the Mumbai Indians back in the hunt, as they now look to stifle Heinrich Klaasen, who is struggling to find his timing at 15 off 20 balls with the score at 113 for 4 in the 16th over. The bowlers will be keen to maintain this momentum and apply further pressure as the innings approaches its final stages."
  },
  {
    "timestamp": "2025-04-17T21:01:12.508411",
    "commentary": "Trent Boult's crucial wicket of Nitish Kumar Reddy has shifted the momentum for the Mumbai Indians, now looking to capitalize on Heinrich Klaasen's struggle, who remains at 15 off 20 balls with the score at 113 for 4 in the 16th over. The bowlers will be eager to build on this breakthrough and apply further pressure as they approach the final overs."
  },
  {
    "timestamp": "2025-04-17T21:01:39.382502",
    "commentary": "Trent Boult has managed to secure a vital wicket, dismissing Nitish Kumar Reddy, but Heinrich Klaasen remains at the crease struggling for form at 15 off 20 balls, as the score now stands at 114 for 4 with Aniket Verma joining him on strike. The Mumbai Indians bowlers will be looking to capitalize on this breakthrough and apply further pressure in the closing overs."
  },
  {
    "timestamp": "2025-04-17T22:54:49.672890",
    "commentary": "With the score at 128 for 4, the Mumbai Indians need 35 runs from 5.3 overs, but Pat Cummins has just struck again, dismissing Jacks and putting the pressure back on the batting side as they now look to regroup with Tilak Varma at the non-striker's end."
  },
  {
    "timestamp": "2025-04-17T22:55:10.817070",
    "commentary": "With the score at 128 for 4, the Mumbai Indians now require 35 runs from 5.3 overs after Pat Cummins has struck again, dismissing Jacks and putting the pressure back on the batting side, as Tilak Varma looks to find his footing at the non-striker's end. The run rate has climbed to 6.36 per over, and the team will need to regroup quickly to chase down the target."
  },
  {
    "timestamp": "2025-04-17T22:55:40.009254",
    "commentary": "With the score at 128 for 4, Mumbai Indians now need 35 runs from 5.3 overs after Pat Cummins' crucial wicket of Jacks, leaving Tilak Varma at the non-striker's end, still looking to find his rhythm as the required run rate climbs to 6.36 per over. The pressure is mounting as they aim to chase down the target of 163."
  },
  {
    "timestamp": "2025-04-17T22:56:06.363907",
    "commentary": "With Jacks dismissed by Pat Cummins, the Mumbai Indians now find themselves needing 35 runs from 5.3 overs, while Tilak Varma, struggling to find his rhythm at the non-striker's end, will need to step up as the required run rate rises to 6.36 per over. Cummins has been outstanding with figures of 3/17, further intensifying the pressure on the batting side."
  },
  {
    "timestamp": "2025-04-17T22:56:33.511829",
    "commentary": "With the score at 128 for 4, Mumbai Indians still need 35 runs from 5.2 overs, as Hardik Pandya faces the daunting task of finding his form against a fiery Pat Cummins, who has taken 3 wickets for just 17 runs. The pressure is on as Varma, currently at the non-striker's end, looks to regroup and get the chase back on track."
  },
  {
    "timestamp": "2025-04-17T22:57:01.436425",
    "commentary": "With the score at 132 for 4, the Mumbai Indians now require 31 runs from 31 balls, as Hardik Pandya looks to capitalize on his aggressive start with a six, while Pat Cummins continues to pose a significant threat with his impressive figures of 3 for 21. Tilak Varma, still seeking his rhythm, will need to support Pandya to steer their chase back on track."
  },
  {
    "timestamp": "2025-04-17T22:57:29.789317",
    "commentary": "With the score at 132 for 4, the Mumbai Indians now require 31 runs from the remaining 31 balls, as Hardik Pandya looks to maintain his momentum after hitting a four off Pat Cummins, while Tilak Varma needs to find his footing quickly to support the chase. Cummins remains a potent threat with his impressive figures of 3 for 21, keeping the pressure firmly on the batting side."
  },
  {
    "timestamp": "2025-04-17T22:57:59.233948",
    "commentary": "With the score at 133 for 4, the Mumbai Indians now need just 30 runs from 31 balls, as Hardik Pandya starts to find his groove with a boundary, while Tilak Varma at the non-striker's end will be keen to join the party and help steer this chase home against a threatening Pat Cummins, who has taken three wickets for 22 runs."
  },
  {
    "timestamp": "2025-04-17T22:58:26.695457",
    "commentary": "With the score at 137 for 4, Mumbai Indians now require 26 runs from the remaining 30 balls, as Hardik Pandya continues to assert himself with another boundary, while Tilak Varma at the non-striker's end will be eager to contribute as the pressure mounts against Pat Cummins, who has taken three wickets for 26 runs."
  },
  {
    "timestamp": "2025-04-17T22:58:50.455426",
    "commentary": "With the score at 137 for 4, Mumbai Indians now require just 26 runs from 30 balls, as Hardik Pandya has started to find his rhythm with a couple of boundaries, while Tilak Varma will look to support him and keep the chase on track against the ever-threatening Pat Cummins, who has impressive figures of 3 for 26."
  },
  {
    "timestamp": "2025-04-17T22:59:15.774011",
    "commentary": "With the score at 137 for 4, Mumbai Indians now need just 26 runs from 30 balls, as Hardik Pandya is on fire with his aggressive batting, hitting two boundaries in quick succession. Tilak Varma, still looking to find his rhythm, will need to step up as they face the challenge of Pat Cummins, who has been outstanding with figures of 3 for 26."
  },
  {
    "timestamp": "2025-04-17T22:59:43.165913",
    "commentary": "With the score at 138 for 4, Mumbai Indians now require just 25 runs from 29 balls, as Tilak Varma has settled into his innings with a single off Eshan Malinga, while Hardik Pandya's explosive start continues to keep the momentum alive with two sixes already to his name. Pat Cummins has been exceptional, but the chase is well within reach for the batting side."
  },
  {
    "timestamp": "2025-04-17T23:04:43.678781",
    "commentary": "With the score now at 148 for 4, Mumbai Indians require just 15 runs from 23 balls as Tilak Varma finds some rhythm with a couple of boundaries, while Hardik Pandya’s explosive batting continues to put them in a strong position against Harshal Patel, who has been economical thus far. The target of 163 is well within reach as the chase intensifies."
  },
  {
    "timestamp": "2025-04-17T23:06:41.095134",
    "commentary": "With the score at 155 for 4, Mumbai Indians now require just 8 runs from 21 balls, as Hardik Pandya powers them closer to victory with a massive six off Harshal Patel, while Tilak Varma looks to keep the momentum going from the non-striker's end. The target of 163 is well within their grasp as the pressure mounts on the bowling side."
  },
  {
    "timestamp": "2025-04-17T23:07:36.755703",
    "commentary": "With the score at 160 for 4, Mumbai Indians now require just 3 runs from the remaining 19 balls, as Hardik Pandya continues his onslaught with a stunning six and a four in the previous over, while Tilak Varma looks to support him well from the non-striker's end. The target of 163 is almost within their grasp as the crowd buzzes with anticipation."
  },
  {
    "timestamp": "2025-04-17T23:08:14.187722",
    "commentary": "Mumbai Indians are now just 3 runs away from victory with 19 balls left, as Hardik Pandya's explosive form continues to shine, having smashed a six and a four in the last over. Tilak Varma, currently on strike, will be looking to finish this off as the crowd eagerly anticipates the winning moment."
  },
  {
    "timestamp": "2025-04-17T23:08:37.195971",
    "commentary": "Mumbai Indians now require just 2 runs for victory with 18 balls remaining, as Tilak Varma and Hardik Pandya continue to push the chase forward, with Pandya's explosive hitting keeping the pressure on Harshal Patel. The crowd is on the edge of their seats as this thrilling finish approaches."
  },
  {
    "timestamp": "2025-04-17T23:08:58.938229",
    "commentary": "Mumbai Indians now require just 2 runs for victory with 18 balls remaining, as Tilak Varma is looking to finish the job after a couple of singles, while Hardik Pandya's explosive batting continues to keep the pressure on Harshal Patel. The crowd is buzzing in anticipation of the winning moment as the target of 163 is tantalizingly close."
  }
]